Repository: eryktomaszek/symfony-wallet
Catalog: app/translations/validators.*.xlf
Languages: pl

# wallet.balance_error
source: The wallet balance must be zero or greater.
pl: Saldo portfela musi być większe lub równe zero.

# transaction.amount.positive
source: Wallet balance too low.
pl: Saldo portfela zbyt niskie.

source: Please enter an email.
pl: Proszę wprowadzić email.

source: The email is not a valid email.
pl: Email nie jest prawidłowy.

source: Please enter a password.
pl: Proszę wprowadzić hasło.

source: Your password should be at least {{ limit }} characters.
pl: Twoje hasło musi mieć co najmniej {{ limit }} znaków.

# password.current.not_blank
source: The current password should not be blank.
pl: Obecne hasło nie może być puste.

# password.new.not_blank
source: The new password should not be blank.
pl: Nowe hasło nie może być puste.

# password.new.min_length
source: The new password should be at least {{ limit }} characters long.
pl: Nowe hasło musi mieć co najmniej {{ limit }} znaków.

# password.confirm.not_blank
source: The confirmation password should not be blank.
pl: Potwierdzenie hasła nie może być puste.

# category.name.unique
source: The category name must be unique.
pl: Nazwa kategorii musi być unikalna.

# category.name.type
source: The category name must be a valid string.
pl: Nazwa kategorii musi być prawidłowym ciągiem znaków.

# category.name.not_blank
source: The category name should not be blank.
pl: Nazwa kategorii nie może być pusta.

# category.name.min_length
source: The category name must be at least {{ limit }} characters long.
pl: Nazwa kategorii musi mieć co najmniej {{ limit }} znaków.

# category.name.max_length
source: The category name cannot be longer than {{ limit }} characters.
pl: Nazwa kategorii nie może być dłuższa niż {{ limit }} znaków.

# category.description.type
source: The category description must be a valid string.
pl: Opis kategorii musi być prawidłowym ciągiem znaków.

# category.description.max_length
source: The category description cannot be longer than {{ limit }} characters.
pl: Opis kategorii nie może być dłuższy niż {{ limit }} znaków.

# category.created_at.type
source: The creation date must be a valid date.
pl: Data utworzenia musi być prawidłową datą.

# category.updated_at.type
source: The update date must be a valid date.
pl: Data aktualizacji musi być prawidłową datą.

# category.slug.type
source: The slug must be a valid string.
pl: Slug musi być prawidłowym ciągiem znaków.

# category.slug.min_length
source: The slug must be at least {{ limit }} characters long.
pl: Slug musi mieć co najmniej {{ limit }} znaków.

# category.slug.max_length
source: The slug cannot be longer than {{ limit }} characters.
pl: Slug nie może być dłuższy niż {{ limit }} znaków.

# transaction.amount.not_null
source: Please enter an amount.
pl: Proszę podać kwotę.

# transaction.description.not_blank
source: The transaction description should not be blank.
pl: Opis transakcji nie może być pusty.

# transaction.description.min_length
source: The transaction description must be at least {{ limit }} characters long.
pl: Opis transakcji musi mieć co najmniej {{ limit }} znaków.

# transaction.description.max_length
source: The transaction description cannot be longer than {{ limit }} characters.
pl: Opis transakcji nie może być dłuższy niż {{ limit }} znaków.

# transaction.type.not_blank
source: The transaction type should not be blank.
pl: Typ transakcji nie może być pusty.

# transaction.type.invalid_choice
source: The transaction type is invalid.
pl: Typ transakcji jest nieprawidłowy.

# transaction.date.not_null
source: The transaction date cannot be null.
pl: Data transakcji nie może być pusta.

# transaction.date.invalid_type
source: The transaction date must be a valid date.
pl: Data transakcji musi być prawidłową datą.

# transaction.wallet.not_null
source: The wallet cannot be null.
pl: Portfel nie może być pusty.

# transaction.category.not_null
source: The category cannot be null.
pl: Kategoria nie może być pusta.

# wallet.title.not_blank
source: The wallet title should not be blank.
pl: Tytuł portfela nie może być pusty.

# wallet.title.min_length
source: The wallet title must be at least {{ limit }} characters long.
pl: Tytuł portfela musi mieć co najmniej {{ limit }} znaków.

# wallet.title.max_length
source: The wallet title cannot be longer than {{ limit }} characters.
pl: Tytuł portfela nie może być dłuższy niż {{ limit }} znaków.

# wallet.description.max_length
source: The wallet description cannot be longer than {{ limit }} characters.
pl: Opis portfela nie może być dłuższy niż {{ limit }} znaków.

# wallet.balance.not_null
source: The wallet balance cannot be null.
pl: Saldo portfela nie może być puste.

# wallet.balance.type
source: The wallet balance must be a number.
pl: Saldo portfela musi być liczbą.

# wallet.created_at.type
source: The creation date must be a valid date.
pl: Data utworzenia musi być prawidłową datą.

# wallet.updated_at.type
source: The update date must be a valid date.
pl: Data aktualizacji musi być prawidłową datą.

# wallet.slug.type
source: The slug must be a valid string.
pl: Slug musi być prawidłowym ciągiem znaków.

# wallet.slug.min_length
source: The slug must be at least {{ limit }} characters long.
pl: Slug musi mieć co najmniej {{ limit }} znaków.

# wallet.slug.max_length
source: The slug cannot be longer than {{ limit }} characters.
pl: Slug nie może być dłuższy niż {{ limit }} znaków.

# tag.title.not_blank
source: The tag title should not be blank.
pl: Tytuł tagu nie może być pusty.

# tag.title.min_length
source: The tag title must be at least {{ limit }} characters long.
pl: Tytuł tagu musi mieć co najmniej {{ limit }} znaków.

# tag.title.max_length
source: The tag title cannot be longer than {{ limit }} characters.
pl: Tytuł tagu nie może być dłuższy niż {{ limit }} znaków.
